{
  "main": {
    "about": "Hi my name is Ole Jacob. I'm a dedicated and ambitious student currently pursuing a 5-year master's program in Computer Science at NTNU in Trondheim. Currently in my third year, I have found a true passion for the world of technology and am enthusiastic about my chosen path as a developer in the IT sector.",
    "ai": "With a keen interest in the intersection of technology and artificial intelligence, I have chosen to specialize in the field of AI. I'm fascinated by the possibilities that AI offers and its potential to transform various industries, and I hope to contribute to cutting-edge innovations in this domain.",
    "interest": "I attended Rosenvilde High School, where I took programming (Python) as an elective course. This sparked my interest in programming and other aspects related to computers, leading me to choose computer science as my field of study.",
    "courses": "So far, during my studies, I have covered several subjects that I find relevant to the professional world. These include 'Object-Oriented Programming' (Java), 'Software Development' (typescript), 'Data Modeling and Database Systems' (SQL) and 'Machine Learning'. In several of these courses, I/we have developed projects. Information about these projects can be found in the 'Projects'-tab.",
    "current-work": "I currently hold a position in the organization Vektorprogrammet. This is a voluntary student organization that sends assistants to schools to help with mathematics. I am part of the IT team and work as a developer. This means that I don't go to schools to provide assistance directly, but I collaborate with the rest of the IT team a few times a week.",
    "current-project": "Currently, our team is working on developing a new website using React with Typescript, and the backend is built with PHP and SQL (More info in 'Projects'-tab). Being a member of this IT team since spring 2023 has given me valuable experience in relevant team-based work over an extended period.",
    "sparetime": "When I'm not coding, I enjoy playing football and working out at the gym. NTNU has a student football league where teams from various study programs compete. Within the Datateknologi program, there's a team called 'Datakameratene', which participates in both 11-a-side and 7-a-side matches. Here's a picture of me with the 7-a-side team at the end of the previous season."
  },

  "projects": {
    "vektor":"I currently hold a position in the organization Vektorprogrammet. This is a voluntary student organization that sends assistants to schools to help with STEM subjects. I am part of the IT team and work as a developer. This means that I dont go to schools to provide assistance directly, but I collaborate with the rest of the IT team a few times a week. Currently, our team is working on developing a new website using React with Typescript, and the backend is built with PHP and SQL (More info in 'Projects'-tab). Being a member of this IT team since spring 2023 has given me valuable experience in relevant team-based work over an extended period. Some of my recent work has been the new login popup for the website. If you want to read more about the organization or see the github-code for the project, links are to the right.",
    "ibdb": "IBDb - Internet Book Database, is a website inspired by IMDb. On this site, you can search for books, authors, and read about each individual book. You can create a user account and provide ratings for the books you have read, in order to help others decide which book they want to read. This project was a part of a subject I had in my 2nd year. We were a group of six students working together on a frontend using React and backend using firebase.",
    "workout": "WorkoutJournal is an application that I created in Java and JavaFX. The app can be used to log workouts, mood and sleep, and see the statistics for the workouts.The project was developed in relation to the Object-Oriented Programming course (TDT4100) at NTNU.",
    "clothingstorage": "Clothing Storage is an application for clothing storage written in Java. The project was created by group 2251 in the IT1901 course at NTNU. The ClothingStorage app aims to assist clothing store owners and employees in managing their inventories. Users can get an overview of the clothes in their inventory, add or remove clothes, change prices, apply discounts to clothes and brands, as well as the ability to filter based on clothing type, brand, price, and discounts. The app also has a dedicated statistics page that displays inventory statistics.",
    "tictactoe": "TicTacToe is a game that I have made using Java and JavaFX. The project was created on my own initiative and is not a part of my education at NTNU. In this version of TicTacToe you can play either two player on the same device or one player against a computer.",
    "nim": "Nim is a game that I have made using Java and JavaFX. The project was created on my own initiative and is not a part of my education at NTNU. Nim is a game for two players. The game consists of four rows with different numbers of matches (1, 3, 5, 7). Players take turns drawing a desired number of matches from one row at a time, and the player who has to draw the last match loses."
  }
}